from .settings import Lang


class PushText:
    product_activated = {
        Lang.RU: 'Ваше объявление успешно размещено!',
        Lang.KY: 'Жарыяңыз учурда активдүү!'
    }

    product_blocked = {
        Lang.RU: "Ваше объявление было заблокировано модератором по причине несоответствия \
                    правилам размещения объявлений на сервисе Tez Sat.",
        Lang.KY: "Сиздин жарыяңыз Tez Sat тиркемесинин жарыя жайгаштыруу \
                    боюнча эрежелерине каршы келгендиктен блоктолду "
    }

    new_message = {
        Lang.RU: 'Новое сообщение!',
        Lang.KY: 'Жаңы билдирүү!'
    }

    new_favorite = {
        Lang.RU: 'Ваше объявление добавили в “Избранное!”',
        Lang.KY: 'Жарыяңыз тандалмаларга кошулду!'
    }

    business_activated = {
        Lang.RU: 'Бизнес-аккаунт успешно активирован!',
        Lang.KY: 'Бизнес-аккаунт ийгиликтүү активдештирилди!'
    }

    new_comment = {
        Lang.RU: 'На Ваше объявление оставили отзыв!',
        Lang.KY: 'Жарыяңызга ой-пикир калтырылды!'
    }

    upvote_reminder = {
        Lang.RU: 'Доступно поднятие объявления!',
        Lang.KY: 'Жарыяңызды көтөрө аласыз!'
    }

    new_review = {
        Lang.RU: 'Новый отзыв',
        Lang.KY: 'Жаңы пикир',
    }

    response_review = {
        Lang.RU: 'Ответ отзыву',
        Lang.KY: 'Пикирге жооп',
    }

    payment_title = {
        Lang.RU: 'Оплата',
        Lang.KY: 'Төлөм',
    }

    replenishment_title = {
        Lang.RU: 'Пополнение',
        Lang.KY: 'Толуктоо',
    }
    denied_title = 'Tez Sat'


class PushBody:
    upvote_reminder = {
        Lang.KY: "Жарыяңыз көбүрөөк адамдарга көрүнүшү жана башкы бетке чыгышы үчүн аны жогору көтөрсөңүз болот."
                 " Көтөрүү акысыз.",
        Lang.RU: "Для большего показа Вы можете поднять свое объявление на верхние строки. Функция поднятия бесплатная."
    }

    new_review = {
        Lang.RU: 'На ваше объявление оставили отзыв',
        Lang.KY: 'Сиздин жарыяңызга пикир калтырылды'
    }

    response_review = {
        Lang.RU: 'Ваш отзыв прокомментирован',
        Lang.KY: 'Сиздин пикириңизге жооп берилди'
    }

    payment_body = {
        Lang.RU: 'Платеж успешно проведён!',
        Lang.KY: 'Төлөм ийгиликтүү аткарылды!'
    }

    replenishment_body = {
        Lang.RU: 'Ваш кошелек был пополнен на сумму %s',
        Lang.KY: 'Капчыгыңыз %s сомго толукталды'
    }

    denied_body = {
        Lang.RU: 'Ваша заявка рассмотрена и к сожалению, она отклонена с связи с несоответствием к требованиям бизнес-профилей. Но вы можете пользоваться \n'
                 'всем остальным функционалом сервиса Tez Sat бесплатно! Надеемся и дальше быть Вам полезными! ',  #
        Lang.KY: 'Сиздин арыз каралып, тилекке каршы бизнес-профилдин талаптарына жооп бербегени үчүн четке кагылды. Бирок сиз Tez Sat кызматынын калган \n'
                 'функцияларын акысыз колдоно аласыз! Биз мындан ары да сизге пайдабыз тийет деп үмүттөнөбүз!'
    }

class PushStatus:
    UPVOTE = 'upvote'
